import Numeric.LinearAlgebra
import Text.Printf

disp m = putStrLn $ format "  " (printf "%.3f") m
dispv v = disp $ fromColumns [v]

k = (6><6)
    [  20, 10,-10,  0,-10,-10
    ,  10, 10,  0,  0,-10,-10
    , -10,  0, 10,  0,  0,  0
    ,   0,  0,  0,  5,  0, -5
    , -10,-10,  0,  0, 10, 10
    , -10,-10,  0, -5, 10, 15 :: Double ]

-- в k' мы заменили 1,2&4 столбцы/колонки на 1-цы
-- а в f' приравняли эти чиселки нулю.
-- таким макаром мы получили, что смещения = 0
-- безо всяких вычеркиваний строк/колонок

k' = (6><6)
    [   1,  0,  0,  0,  0,  0
    ,   0,  1,  0,  0,  0,  0
    ,   0,  0, 10,  0,  0,  0
    ,   0,  0,  0,  1,  0,  0
    ,   0,  0,  0,  0, 10, 10
    ,   0,  0,  0,  0, 10, 15 :: Double ]

f' = 6 |> [0,0,0,0,2,1] 
u = k' <\> f'

-- восстанавливаем силы уже по полной матрице k

f = k <> u
